import axios from 'axios'

const API_RESOURCE_URL = import.meta.env.VITE_RESOURCE_URL

const MATERIALS_PARAMS = [
  {
    "Код": "DS000000908",
    "Наименование": "Круг шлифовальный 1200*20*32 14А",
    "ЕдиницаИзмерения": "шт",
    "Услуга": "false",
    "ГУИД": "fc306c00-82a7-11ee-8d47-047c16"
  },
  {
    "Код": "DS000000921",
    "Наименование": "фен технический ",
    "ЕдиницаИзмерения": "шт",
    "Услуга": "false",
    "ГУИД": "d1d0985b-8431-11ee-8d49-047c16"
  },
  {
    "Код": "DS000000922",
    "Наименование": "Круг отрезной \"Х-2\" по нержавеющей стали 150х1,6х22,2мм ЗУБР",
    "ЕдиницаИзмерения": "шт",
    "Услуга": "false",
    "ГУИД": "c34a004e-843c-11ee-8d49-047c16"
  },
  {
    "Код": "DS000000923",
    "Наименование": "Круг отрезной \"Х-2\" по нержавеющей стали 125х1,6х22,2мм ЗУБР",
    "ЕдиницаИзмерения": "шт",
    "Услуга": "false",
    "ГУИД": "c34a004f-843c-11ee-8d49-047c16"
  },
  {
    "Код": "DS000000924",
    "Наименование": "Каска РОСОМЗ СОМЗ-55 FAVORIT TREK ТРЕК 75114 цв. оран",
    "ЕдиницаИзмерения": "шт",
    "Услуга": "false",
    "ГУИД": "c34a0052-843c-11ee-8d49-047c16"
  }
]

const SERVICES_PARAMS = [
  {
    "Код": "DS000000961",
    "Наименование": "Дезинсекционные работы",
    "ЕдиницаИзмерения": "",
    "Услуга": "true",
    "ГУИД": "6c48e0f8-8849-11ee-8d49-047c16"
  },
  {
    "Код": "DS000001044",
    "Наименование": "Обследование источника бесперебойного питания ",
    "ЕдиницаИзмерения": "",
    "Услуга": "true",
    "ГУИД": "1082d8e6-8d00-11ee-8d49-047c16"
  },
  {
    "Код": "DS000001085",
    "Наименование": "Расходы на проезд",
    "ЕдиницаИзмерения": "",
    "Услуга": "true",
    "ГУИД": "82db8484-97cc-11ee-8d49-047c16"
  },
  {
    "Код": "DS000001118",
    "Наименование": "Поверка/калибровка дефектоскопа",
    "ЕдиницаИзмерения": "",
    "Услуга": "true",
    "ГУИД": "0bed3ef4-98c7-11ee-8d49-047c16"
  },
  {
    "Код": "DS000001119",
    "Наименование": "Ремонт автосцепки  (Обточка колесной пары МПТ )",
    "ЕдиницаИзмерения": "",
    "Услуга": "true",
    "ГУИД": "0bed3f0b-98c7-11ee-8d49-047c16"
  }
]

export async function loadServices1C() {
  const response = await axios.post(
    API_RESOURCE_URL,
    {
      method: 'import/loadMeta1C',
      params: [SERVICES_PARAMS, 'Cls_Service']
    },
    { withCredentials: true }
  )
  return response.data
}

export async function loadMaterials1C() {
  const response = await axios.post(
    API_RESOURCE_URL,
    {
      method: 'import/loadMeta1C',
      params: [MATERIALS_PARAMS, 'Cls_Material']
    },
    { withCredentials: true }
  )
  return response.data
}
